Examinator/src/Catalogs/УчебныеГруппыСУО/УчебныеГруппыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/УчебныеГруппыСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция Участники(УчебнаяГруппа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчебныеГруппыСУОСостав.Пользователь,
		|	УчебныеГруппыСУОСостав.Пользователь.Наименование КАК Наименование
		|ИЗ
		|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
		|ГДЕ
		|	УчебныеГруппыСУОСостав.Ссылка = &УчебнаяГруппа";

	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(УчебнаяГруппа, ДополнительныеДанные=Неопределено) Экспорт


	
	УстановитьПривилегированныйРежим(Истина);
	
	// Примечание: Переменная УчебнаяГруппа может быть двух типов:
	//	- УчебныеГруппыОО
	//  - УчебныеГруппыСУО
	
	// Получаем данные группы
	
	ДанныеГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчебнаяГруппа, "Наименование, ПометкаУдаления");
	
	// Удаляем данные
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(УчебнаяГруппа, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппа);
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(УчебнаяГруппа, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппаОписание);
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(УчебнаяГруппа);
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(УчебнаяГруппа, "Справочник.УчебныеГруппыСУО");
	
	Если НЕ ДанныеГруппы.ПометкаУдаления Тогда
	
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(УчебнаяГруппа);
		УчастникиГруппы = МенеджерОбъекта.Участники(УчебнаяГруппа);
		
		// Сохраняем данные веб-кабинета
		
		Зависимости = Новый Массив;
		
		УчебнаяГруппаJSON = УчебнаяГруппаJSON(УчебнаяГруппа, ДанныеГруппы.Наименование);
		ОписаниеУчебнойГруппыJSON = УчебнаяГруппаОписаниеJSON(УчебнаяГруппа, ДанныеГруппы.Наименование, УчастникиГруппы, Зависимости);
		
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппа, УчебнаяГруппа, УчебнаяГруппаJSON, Перечисления.ФорматыВебДанныхСУ.json);
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппаОписание, УчебнаяГруппа, ОписаниеУчебнойГруппыJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
		// Зависимости
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(УчебнаяГруппа, "Справочник.УчебныеГруппыСУО", Зависимости);
		
		// Отборы
		
		Для каждого Участник Из УчастникиГруппы Цикл
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(УчебнаяГруппа, Участник.Пользователь);
		КонецЦикла;		
		
	КонецЕсли;
		
	
		
КонецПроцедуры

Функция УчебнаяГруппаJSON(Знач УчебнаяГруппа, НаименованиеГруппы="") Экспорт
	
	Если НЕ ЗначениеЗаполнено(НаименованиеГруппы) Тогда
		НаименованиеГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчебнаяГруппа, "Наименование");
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(Новый Структура("Наименование, Идентификатор, Тип", НаименованиеГруппы, Строка(УчебнаяГруппа.УникальныйИдентификатор()), ТипУчебнойГруппыJS(УчебнаяГруппа)));
	
КонецФункции

Функция УчебнаяГруппаОписаниеJSON(Знач УчебнаяГруппа, Знач Наименование, Знач Участники, Зависимости) Экспорт
		
	ОписаниеУчебнойГруппы = Новый Структура("Наименование, Участники, Тип, Идентификатор");
	
	ОписаниеУчебнойГруппы.Наименование = Наименование;
	ОписаниеУчебнойГруппы.Участники = Новый Массив;
	ОписаниеУчебнойГруппы.Тип = ТипУчебнойГруппыJS(УчебнаяГруппа);	
	
	ОписаниеУчебнойГруппы.Идентификатор = Строка(УчебнаяГруппа.УникальныйИдентификатор());
	
	Для каждого Участник Из Участники Цикл
	
		ОписаниеУчастника = ВебКабинетСУО.ПользовательСтруктура(Участник.Пользователь, Участник.Наименование);
		
		ОписаниеУчебнойГруппы.Участники.Добавить(ОписаниеУчастника);
		
		Если Зависимости.Найти(Участник.Пользователь) = Неопределено Тогда
			Зависимости.Добавить(Участник.Пользователь);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеУчебнойГруппы);
	
КонецФункции

Функция ТипУчебнойГруппыJS(УчебнаяГруппа)
	
	Если ТипЗнч(УчебнаяГруппа) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		Возврат "corp";
	КонецЕсли;
	
	Если ТипЗнч(УчебнаяГруппа) = Тип("СправочникСсылка.УчебныеГруппыОО") Тогда
		Возврат "edu";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция МенеджерСправочникаПоТипу(ТипУчебнойГруппы) Экспорт
	
	Если ТипУчебнойГруппы = "corp" Тогда
		Возврат Справочники.УчебныеГруппыСУО;
	КонецЕсли;
	
	Если ТипУчебнойГруппы = "edu" Тогда
		Возврат Справочники.УчебныеГруппыОО;
	КонецЕсли;
	
	Возврат Справочники.УчебныеГруппыСУО;
	
КонецФункции


#КонецЕсли
